[
  {
    "filter":"passeriform",
    "intro":{
      "img":"/assets/images/people/passeriform.png",
      "heading":"About Passeriform",
      "paragraph":"Passeriform is a simple pseudonym for segregating my projects into botches and full-blown products. It's an attempt at maintaining order and providing visual difference to the different kinds of projects I do."
    },
    "contributors":[
      {
        "img":"/assets/images/people/utkarsh-bhardwaj.jpg",
        "title":"Utkarsh Bhardwaj",
        "description":"It's me.",
        "aboutUrl":"utkarsh-bhardwaj"
      }
    ]
  },
  {
    "filter":"utkarsh-bhardwaj",
    "intro":{
      "img":"/assets/images/people/utkarsh-bhardwaj.jpg",
      "heading":"Utkarsh Bhardwaj",
      "paragraph":"Experimenter by approach. Programmer by resolution.\n Generally working on something interesting. Feel free to reach out to me on locations given at the bottom."
    },
    "overview":[
      {
        "img":"/assets/images/landingbg.jpg",
        "paragraph":"I'm a novice software developer trying to get my hands dirty in the market. I've always worked towards creating solutions simple to comprehend, yet highly feature rich."
      },
      {
        "paragraph":"Across projects, I've worked on various domains, jumping between multiple vastly-polar skillset demands. As a result, I'm proficient in multiple languages and frameworks to a point where I can make rapid decisions based on their philosophies."
      },
      {
        "paragraph":"Currently working towards a graduation degree at MIT Manipal in Information Technology, I have ambitions to delve into curious stuff and ultimately becoming the origin of some."
      },
      {
        "paragraph":"I've held multiple positions of responsibility, the list which can be found below, and I'm more than happy to be part of some more."
      },
      {
        "paragraph":"Alternatively, I can play some sweet riffs if you want to jam out. 😉"
      }
    ],
    "story":{
      "timeline":[
        {
          "img":"assets/images/timeline/landingbg",
          "period":"2012-2015",
          "entry":"I started out as a C newbie at the age of 14. My first ever real project was a dart-throwing game entirely made using <graphics.h>. Frolanguagesm here, I'd go on to dabble with Java as my go-to alternative for faster programming cycles, which eventually switched to python. The dramatic point of views between these communities always kept the spark of questioning motives. I would later get into web development due to market demands. From where I'd expand my javascript philosophy to different frameworks and highly specialized domains. From here the utilities and toolset became a vital part of my developer self and I'd get more masterful in the art of packaging a product. My projects had shifted dramatically in style, form and consistency. I still consider myself running in this phase with so much new occuring and all of that for making simpler interfaces for user and developer alike. I see all lot that can be improved in me and in the development paradigm and hence I strive to introduce a change that will propagate simplicity and beauty in code."
        }
      ]
    },
    "contact":{
      "heading":"Contact Details",
      "paragraph":"If you want a discussion or maybe hang out, you can find me at these locations.",
      "links":[
        {
          "type":"github",
          "link":"https://github.com/passeriform/"
        },
        {
          "type":"linkedin",
          "link":"https://www.linkedin.com/in/passeriform/"
        },
        {
          "type":"gmail",
          "link":"mailto:bhardwajutkarsh.ub@gmail.com"
        },
        {
          "type":"twitter",
          "link":"https://twitter.com/passeridev"
        },
        {
          "type":"instagram",
          "link":"https://www.instagram.com/the_og_passeriform/"
        }
      ]
    }
  }
]
